In [1]:
import pandas as pd
import numpy as np

In [2]:
dataFrame = pd.read_excel("#31 - SalarySheet.xlsx")

In [3]:
dataFrame

       Employee Name            Department       Title  Salary
0       Semaj Bowers             Marketing         Mid     600
1        Gary Foster                 Sales         Mid     650
2   Saniya Maldonado                    HR         Mid     600
3     Jillian Zuniga                    HR     C-level    1000
4      Courtney Mora                 Sales         Mid     550
..               ...                   ...         ...     ...
95          Jake Gay                 Sales      Junior     443
96      Macy Webster               Finance     C-level    1250
97     Jaquan Meyers             Marketing  Mid-Senior     800
98       Willow Bush  Software Development      Junior     441
99   Emmanuel Prince                 Sales         Mid     612

[100 rows x 4 columns]

In [4]:
#1) How many rows of data are there in total?

In [5]:
dataFrame.describe()

            Salary
count   100.000000
mean    725.840000
std     248.957816
min     350.000000
25%     547.500000
50%     700.000000
75%     900.000000
max    1900.000000

In [6]:
#2) What is the average salary of this company?

In [7]:
dataFrame.mean(numeric_only=True)

Salary    725.84
dtype: float64

In [8]:
#3) How does the average salary compare by department in this company?

In [9]:
departmentGroup = dataFrame.groupby("Department")

In [10]:
departmentGroup.mean(numeric_only=True)

                          Salary
Department
Finance               805.411765
HR                    640.937500
Marketing             707.000000
Sales                 656.666667
Software Development  826.409091

In [11]:
#4) How does the average salary compare according to title (senior - junior) status in this company?

In [12]:
titleGroup = dataFrame.groupby("Title")

In [13]:
titleGroup.mean(numeric_only=True)

                 Salary
Title
C-level     1058.333333
Junior       440.625000
Mid          641.450000
Mid-Senior   725.500000
Senior       867.777778

In [14]:
#5) What is the average salary of a senior person more than a junior person?

In [15]:
867.77 / 440.625

1.9694070921985816

In [16]:
#6) What is the average salary of a senior person in the software development department compared to a junior person?

In [17]:
dataFrame.loc[dataFrame["Department"] == "Software Development"].groupby("Title").mean(numeric_only = True)

                 Salary
Title
C-level     1183.333333
Junior       430.333333
Mid          633.333333
Mid-Senior   718.333333
Senior       895.000000

In [18]:
895 / 430.33

2.079799223851463

In [19]:
#7) How much higher is the average salary of a c-level person in the Finance department than a mid-senior person?

In [20]:
dataFrame.loc[dataFrame["Department"] == "Finance"].groupby("Title").mean(numeric_only = True)

             Salary
Title
C-level     1030.00
Junior       469.00
Mid          691.25
Mid-Senior   790.00
Senior      1000.00

In [21]:
1030 / 790

1.3037974683544304

In [22]:
#8) How many times more are the number of C-level employees in the software development department than in the marketing department?

In [23]:
dataFrame.loc[dataFrame["Department"] == "Software Development"].groupby("Title").describe()

           Salary                                                           \
            count         mean         std    min     25%     50%      75%
Title
C-level       6.0  1183.333333  371.034590  900.0  950.00  1100.0  1175.00
Junior        3.0   430.333333   26.652079  400.0  420.50   441.0   445.50
Mid           3.0   633.333333  202.072594  450.0  525.00   600.0   725.00
Mid-Senior    6.0   718.333333   69.402209  600.0  700.00   725.0   757.50
Senior        4.0   895.000000   57.300378  815.0  878.75   907.5   923.75


               max
Title
C-level     1900.0
Junior       450.0
Mid          850.0
Mid-Senior   800.0
Senior       950.0

In [24]:
dataFrame.loc[dataFrame["Department"] == "Marketing"].groupby("Title").describe()

           Salary                                                            \
            count         mean         std     min     25%     50%      75%
Title
C-level       2.0  1125.000000  176.776695  1000.0  1062.5  1125.0  1187.50
Junior        3.0   461.333333   25.423087   439.0   447.5   456.0   472.50
Mid           6.0   637.833333   74.351642   550.0   600.0   612.5   681.25
Mid-Senior    4.0   675.000000  125.830574   500.0   650.0   700.0   725.00
Senior        3.0   855.000000  221.528779   600.0   782.5   965.0   982.50


               max
Title
C-level     1250.0
Junior       489.0
Mid          752.0
Mid-Senior   800.0
Senior      1000.0

In [25]:
6 / 2

3.0